In [151]:
import pandas as pd
import numpy as np

In [152]:
df = pd.read_csv("2017_jun_final_EN.csv")
df.head()

,N,Role,Programming language,Specialisation,Experience,Experience on current job,Salary/month,Изменение.зарплаты.за.12.месяцев,City,Company size,...,Still student,English,Subject.area,Date,User.Agent,exp,current_job_exp,salary,Валюта,cls
0,1,Junior QA engineer,NaN,Manual QA,0.5,0.5,400,0,New York,up to 10 employees,...,True,A1,"iOS,eCommerce",12/06/2017 12:38:08,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,0.5,0.5,400,NaN,QA
1,2,Junior QA engineer,NaN,Manual QA,loss then 3 month,loss then 3 month,430,130,New York,more then 1000 employees,...,True,B2,Web development,12/06/2017 12:42:51,Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...,0.0,0.0,430,NaN,QA
2,3,Software Engineer,C#/.NET,NaN,4,1,2500,800,Berlin,up to 1000 employees,...,False,B1,"Web development,Corporative systems",12/06/2017 13:02:47,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,4.0,1.0,2500,NaN,DEV
3,4,Software Engineer,JavaScript,NaN,5,4,2000,400,Odesa,up to 200 employees,...,False,A1,"Desktop Applications,Web development",12/06/2017 13:03:01,Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...,5.0,4.0,2000,NaN,DEV
4,5,Senior Software Engineer,JavaScript,NaN,10+,0.5,4500,500,Other,up to 10 employees,...,False,B1,"Desktop Applications,Web development",12/06/2017 13:03:47,Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...,10.0,0.5,4500,NaN,DEV

In [153]:
(n_rows, n_columns) = df.shape
print(f"number of rows = {n_rows}\nnumber of columns = {n_columns}")

number of rows = 8704
number of columns = 25

In [154]:
data_types = df.dtypes
print(data_types)

N                                     int64
Role                                 object
Programming language                 object
Specialisation                       object
Experience                           object
Experience on current job            object
Salary/month                          int64
Изменение.зарплаты.за.12.месяцев      int64
City                                 object
Company size                         object
Company type                         object
Gender                               object
Age                                   int64
Education                            object
University                           object
Still student                          bool
English                              object
Subject.area                         object
Date                                 object
User.Agent                           object
exp                                 float64
current_job_exp                     float64
salary                                int64
Валюта                               object
cls                                  object
dtype: object

In [155]:
spaces = []


for column in df.columns:
    spaces.append(df[column].isnull().sum())

spaces_proportions = np.array(spaces)/n_rows
print(f"spaces = {spaces} \nspaces proporstions = {spaces_proportions}")

spaces = [0, 0, 3850, 7219, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1546, 0, 0, 223, 0, 0, 0, 0, 0, 8694, 1574]
spaces proporstions = [0.         0.         0.44232537 0.82938879 0.         0.
 0.         0.         0.         0.         0.         0.
 0.         0.         0.17761949 0.         0.         0.0256204
 0.         0.         0.         0.         0.         0.9988511
 0.1808364 ]

In [156]:
i = -1

new_df = df.copy()

for column in df.columns:
    i+=1
    if column == "Programming language":
        continue

    if spaces[i] != 0:
        new_df = new_df.drop(columns=column)

new_df.head()

,N,Role,Programming language,Experience,Experience on current job,Salary/month,Изменение.зарплаты.за.12.месяцев,City,Company size,Company type,Gender,Age,Education,Still student,English,Date,User.Agent,exp,current_job_exp,salary
0,1,Junior QA engineer,NaN,0.5,0.5,400,0,New York,up to 10 employees,Outsourcing,female,20,Unfinished Higher education,True,A1,12/06/2017 12:38:08,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,0.5,0.5,400
1,2,Junior QA engineer,NaN,loss then 3 month,loss then 3 month,430,130,New York,more then 1000 employees,Outsourcing,female,21,Unfinished Higher education,True,B2,12/06/2017 12:42:51,Mozilla/5.0 (iPad; CPU OS 10_2_1 like Mac OS X...,0.0,0.0,430
2,3,Software Engineer,C#/.NET,4,1,2500,800,Berlin,up to 1000 employees,Outsourcing,male,26,Higher education,False,B1,12/06/2017 13:02:47,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,4.0,1.0,2500
3,4,Software Engineer,JavaScript,5,4,2000,400,Odesa,up to 200 employees,product,male,30,Secondary education,False,A1,12/06/2017 13:03:01,Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...,5.0,4.0,2000
4,5,Senior Software Engineer,JavaScript,10+,0.5,4500,500,Other,up to 10 employees,product,male,30,Secondary education,False,B1,12/06/2017 13:03:47,Mozilla/5.0 (iPhone; CPU iPhone OS 10_3_2 like...,10.0,0.5,4500

In [157]:
new_spaces = []


for column in new_df.columns:
    new_spaces.append(new_df[column].isnull().sum())

new_spaces_proportions = np.array(new_spaces)/n_rows
print(f"new spaces = {new_spaces} \nnew spaces proporstions = {new_spaces_proportions}")

new spaces = [0, 0, 3850, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
new spaces proporstions = [0.         0.         0.44232537 0.         0.         0.
 0.         0.         0.         0.         0.         0.
 0.         0.         0.         0.         0.         0.
 0.         0.        ]

In [158]:
df = df.dropna()
df.shape
df.head()

Empty DataFrame
Columns: [N, Role, Programming language, Specialisation , Experience , Experience on current job, Salary/month, Изменение.зарплаты.за.12.месяцев, City, Company size, Company type, Gender, Age, Education, University, Still student, English , Subject.area, Date, User.Agent, exp, current_job_exp, salary, Валюта, cls]
Index: []

[0 rows x 25 columns]

In [159]:
bool_vec = new_df["Programming language"] == "Python"
python_data = new_df[bool_vec]
python_data.head()

,N,Role,Programming language,Experience,Experience on current job,Salary/month,Изменение.зарплаты.за.12.месяцев,City,Company size,Company type,Gender,Age,Education,Still student,English,Date,User.Agent,exp,current_job_exp,salary
12,13,Software Engineer,Python,1,loss then 3 month,800,200,Berlin,up to 50 employees,Outsourcing,male,26,Higher education,False,A1,12/06/2017 13:05:54,Mozilla/5.0 (Windows NT 6.1; Win64; x64) Apple...,1.0,0.0,800
68,69,Software Engineer,Python,1.5,0.5,900,900,Berlin,up to 10 employees,start up,male,21,Unfinished Higher education,True,B2,12/06/2017 13:11:17,Mozilla/5.0 (Windows NT 10.0; Win64; x64) Appl...,1.5,0.5,900
87,88,Junior Software Engineer,Python,0.5,0.5,600,0,Berlin,up to 10 employees,Outsourcing,male,19,Unfinished Higher education,True,B2,12/06/2017 13:12:25,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,0.5,0.5,600
114,115,Junior Software Engineer,Python,1.5,0.5,685,250,Berlin,up to 1000 employees,Outsourcing,male,21,Unfinished Higher education,False,B1,12/06/2017 13:14:52,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,1.5,0.5,685
143,144,Junior Software Engineer,Python,1,1,750,250,Berlin,up to 10 employees,Outsourcing,male,21,Unfinished Higher education,True,B2,12/06/2017 13:19:10,Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/53...,1.0,1.0,750

In [160]:
(pyth_n_rows, pyth_n_col) = python_data.shape

print(f"number of rows = {pyth_n_rows}\nnumber of columns = {pyth_n_col}")

number of rows = 207
number of columns = 20

In [161]:
python_data_grouped_by_role = python_data.groupby("Role").agg({'Salary/month': ['min', 'max']})
python_data_grouped_by_role.head()

                         Salary/month
                                  min   max
Role
Junior Software Engineer          100  1250
Senior Software Engineer         1300  9200
Software Engineer                 500  5400
System Architect                 3000  5000
Technical Lead                   1425  6200

In [162]:
def fill_avg_salary(n):
    avg = sum(n)/len(n)
    return avg

In [171]:
python_data_grouped_by_role['Salary/month - avg'] = python_data_grouped_by_role.apply(fill_avg_salary, axis=1)
python_data_grouped_by_role.head()

                         Salary/month       Salary/month - avg
                                  min   max
Role
Junior Software Engineer          100  1250              675.0
Senior Software Engineer         1300  9200             5250.0
Software Engineer                 500  5400             2950.0
System Architect                 3000  5000             4000.0
Technical Lead                   1425  6200             3812.5

In [172]:
python_data_grouped_by_role['Salary/month - avg'].describe()

count       5.000000
mean     3337.500000
std      1700.091909
min       675.000000
25%      2950.000000
50%      3812.500000
75%      4000.000000
max      5250.000000
Name: Salary/month - avg, dtype: float64

In [173]:
python_data_grouped_by_role.to_csv("Python_data.csv")